Catalogs/СХД_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>СХД_ат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IPv4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийОбъем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДисковаяСистема</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Raid</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыRAID_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>HDD_ат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.HDD_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СХД_ат/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДисковаяСистемаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Элемент.ТекущиеДанные.объем = ДисковаяСистемаПриОкончанииРедактированияНаСервере(
	Элемент.ТекущиеДанные.Количество, Элемент.ТекущиеДанные.HDD_ат, Элемент.ТекущиеДанные.Raid);	 
	
КонецПроцедуры

&НаСервере
Функция ДисковаяСистемаПриОкончанииРедактированияНаСервере(количество,HDD_ат,Raid)
	Возврат РаботаССерверами_ат.ОбъёмДисковойСистемы(количество,HDD_ат,Raid);
КонецФункции


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
//	ПередЗаписьюНаСервере();
Объект.ОбщийОбъем = Объект.ДисковаяСистема.Итог("Объем");
	//Элемент.ОбщийОбьем
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПередЗаписьюНаСервере(Объем)
//	Возврат Объект.ДисковаяСистема.Итог(Объем);	
КонецФункции
